Release 0.2.6: Restore progress and update versions
